---
kind: type
id: T:Autodesk.Revit.DB.Lighting.AdvancedLossFactor
source: html/30e62a9d-eb01-8830-f897-dc8f32b486da.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor

This class encapsulates advanced lighting loss factor calculation.

## Syntax (C#)
```csharp
public class AdvancedLossFactor : LossFactor
```

## Remarks
Advanced lighting loss factor is a combination of several different factors.
 Each factor has a value of 0.0 (total loss) to 1.0 (no loss).